; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	image3 - mode
	image2 - mode
	thermograph0 - mode
	thermograph4 - mode
	image1 - mode
	Star0 - direction
	Star2 - direction
	Star1 - direction
	Star4 - direction
	Star3 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 image3)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph0)
	(supports instrument2 image3)
	(calibration_target instrument2 Star1)
	(supports instrument3 image3)
	(supports instrument3 thermograph4)
	(supports instrument3 image1)
	(calibration_target instrument3 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument4 image1)
	(calibration_target instrument4 Star3)
	(supports instrument5 thermograph4)
	(supports instrument5 thermograph0)
	(supports instrument5 image2)
	(calibration_target instrument5 Star4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument6 image2)
	(calibration_target instrument6 Star2)
	(supports instrument7 image2)
	(calibration_target instrument7 Star1)
	(supports instrument8 image2)
	(supports instrument8 image3)
	(calibration_target instrument8 Star3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument9 thermograph4)
	(supports instrument9 image2)
	(supports instrument9 image3)
	(calibration_target instrument9 Star4)
	(supports instrument10 image2)
	(supports instrument10 image1)
	(supports instrument10 image3)
	(calibration_target instrument10 Star3)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon5)
)
(:goal (and
	(pointing satellite2 Phenomenon6)
	(pointing satellite4 Star3)
	(have_image Phenomenon5 thermograph4)
	(have_image Phenomenon6 image1)
	(have_image Planet7 thermograph4)
	(have_image Phenomenon8 thermograph4)
	(have_image Planet9 thermograph4)
	(have_image Star10 image1)
	(have_image Phenomenon11 image1)
))

)

; plan
1. (turn_to satellite2 phenomenon6 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon6)
   goals met: 1 of 9
2. (turn_to satellite1 star1 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star1)
   goals met: 1 of 9
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 9
4. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 1 of 9
5. (turn_to satellite1 phenomenon6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 9
6. (take_image satellite1 phenomenon6 instrument3 image1)
   added: (have_image phenomenon6 image1)
   goals met: 2 of 9
7. (turn_to satellite1 phenomenon5 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 9
8. (take_image satellite1 phenomenon5 instrument3 thermograph4)
   added: (have_image phenomenon5 thermograph4)
   goals met: 3 of 9
9. (turn_to satellite1 phenomenon11 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon11)
   goals met: 3 of 9
10. (take_image satellite1 phenomenon11 instrument3 image1)
   added: (have_image phenomenon11 image1)
   goals met: 4 of 9
11. (turn_to satellite1 phenomenon8 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 9
12. (take_image satellite1 phenomenon8 instrument3 thermograph4)
   added: (have_image phenomenon8 thermograph4)
   goals met: 5 of 9
13. (turn_to satellite1 planet7 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet7)
   goals met: 5 of 9
14. (take_image satellite1 planet7 instrument3 thermograph4)
   added: (have_image planet7 thermograph4)
   goals met: 6 of 9
15. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   goals met: 6 of 9
16. (take_image satellite1 planet9 instrument3 thermograph4)
   added: (have_image planet9 thermograph4)
   goals met: 7 of 9
17. (turn_to satellite1 star10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star10)
   goals met: 7 of 9
18. (take_image satellite1 star10 instrument3 image1)
   added: (have_image star10 image1)
   goals met: 8 of 9
19. (turn_to satellite4 star3 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 star3)
   goals met: 9 of 9
